package main

import "fmt"

// 5. Возьми канал из задания 4 (буфер 3) и попробуй положить в него четвёртое значение
// всё так же без горутины и без чтения.
// Запусти, посмотри на зависание в терминале, затем закомментируй эту четвёртую отправку
// и комментарием объясни, почему буфер на 3 не даёт положить четвёртое значение, пока никто не читает.

func task5() {
	ch := make(chan int, 3)

	ch <- 1
	ch <- 2
	ch <- 3
	//ch <- 4 // когда буфер полный он не может принять новое значение, сперва должно быть освобождено место в буфере

	fmt.Println("len:", len(ch), ", cap:", cap(ch))

	fmt.Println("value:", <-ch)
	fmt.Println("value:", <-ch)
	fmt.Println("value:", <-ch)

	fmt.Println("len:", len(ch), ", cap:", cap(ch))
}
