package main

import "fmt"

// 7. Заведи канал, положи в него числа 1, 2, 3, затем закрой его через close(ch).
// После этого трижды прочитай из канала через v, ok := <-ch и ещё один — четвёртый — раз.
// Выведи для всех четырёх чтений и значение v, и флаг ok, и объясни комментарием,
// что возвращает чтение из закрытого пустого канала.

func task7() {
	ch := make(chan int)

	go func() {
		ch <- 1
		ch <- 2
		ch <- 3
		close(ch)
	}()

	v, ok := <-ch
	fmt.Println(v, ok)
	v2, ok := <-ch
	fmt.Println(v2, ok)
	v3, ok := <-ch
	fmt.Println(v3, ok)
	v4, ok := <-ch
	fmt.Println(v4, ok) // возвращает значение типа по умолчанию
}
