package main

import (
	"fmt"
	"time"
)

// 6. Сравни время работы двух вариантов на канале с буфером 5:
// в первом варианте положи 5 чисел без горутины и замерь время (time.Now()/time.Since())
// — отправка не блокируется, потому что буфер не заполнен;
// во втором варианте положи 6 чисел в тот же буфер (с горутиной-получателем сбоку,
// которая читает с паузой time.Sleep(200*time.Millisecond) перед каждым чтением) и замерь время.
// Выведи оба времени и коротко прокомментируй разницу.

func task6() {
	ch1 := make(chan int, 5)

	start := time.Now()

	for i := 1; i <= 5; i++ {
		ch1 <- i
	}

	t1 := time.Since(start)

	ch2 := make(chan int, 5)

	go func() {
		for i := 1; i <= 6; i++ {
			time.Sleep(200 * time.Millisecond)
			<-ch2
		}
	}()

	start = time.Now()

	for i := 1; i <= 6; i++ {
		ch2 <- i
	}

	t2 := time.Since(start)

	fmt.Println("Вариант 1 (5 чисел):", t1)
	fmt.Println("Вариант 2 (6 чисел):", t2) // на 200мс позже потому что 6-ое сообщение ждал это время
}
